import queue

ALPHA = 1.0  # 信息启发因子
BETA = 2.0  # 期望启发因子
RHO = 0.5  # 信息素挥发因子
Q = 100.0  # 信息素释放总量

ant_num = 75  # 蚁群数量
city_num = 50  # 城市数量

# 城市坐标
# 3778
distance_x = [
    178, 272, 176, 171, 650, 499, 267, 703, 408, 437, 491, 74, 532,
    416, 626, 42, 271, 359, 163, 508, 229, 576, 147, 560, 35, 714,
    757, 517, 64, 314, 675, 69, 391, 628, 87, 240, 705, 699, 258,
    428, 614, 36, 360, 482, 666, 597, 209, 201, 492, 294]
distance_y = [
    170, 395, 198, 151, 242, 556, 57, 401, 305, 421, 267, 105, 525,
    381, 244, 330, 395, 169, 141, 380, 153, 442, 528, 329, 232, 48,
    498, 265, 343, 120, 165, 50, 433, 63, 491, 275, 348, 222, 288,
    490, 213, 524, 244, 114, 104, 552, 70, 425, 227, 331]
# 城市距离
distance_graph = [[0.0 for i in range(city_num)] for j in range(city_num)]  # 列表解析 初始化城市距离为0

# 信息素
pheromone_graph = [[1.0 for i in range(city_num)] for j in range(city_num)]  # 初始化信息素为1

# 最优路径
best_path = []

weight = 1
loss_value = 0